Revit 2026 API

# SpotDimensionLeaderShoulderPosition Property

---

Position of spot dimension's leader shoulder point.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ LeaderShoulderPosition { get; set; }
```
```vb
Public Property LeaderShoulderPosition As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ LeaderShoulderPosition {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member LeaderShoulderPosition : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |
| InvalidOperationException | Dimension must have leader. -or- Dimension's leader must have shoulder. -or- Thrown when: |

  * SpotDimension style type is SpotSlope.
  * Using equality formula.
  * Dimension style is ordinate.

-or- The dimension is a SpotSlope or has no leader or leader has no shoulder.

Setting of this property also affects LeaderEndPosition and TextPosition.

#### Reference

SpotDimension Class

Autodesk.Revit.DB Namespace